{
   "entries": [{"title": "COPYRIGHT DAY", "date": "1/1/2022", "content": "If neither you nor your daughter can pronounce the words in a book report that you argue was not plagiarized, you might be a bad parent."}
   , 
   {"title": "NATIONAL SCIENCE FICTION DAY", "date": "1/2/2022", "content": "If it is a well-known fact that your son is in Juvenile Detention; but you call the school to report that he is attending a three week science camp, you might be a bad parent."}
   , {"title": "FESTIVAL OF SLEEP DAY", "date": "1/3/2022", "content": "If in an effort to justify your son’s habit of sleeping during the school day, you send a dozen science articles to his math teacher supporting adolescent sleep needs, you might be a bad parent."}
   , {"title": "WORLD BRAILLE DAY", "date": "1/4/2022", "content": "If you have attended a school open house with your son or daughter for the sole purpose of pointing out the blind spots in the school’s camera system, you might be a bad parent."}
   , {"title": "NATIONAL BIRD DAY", "date": "1/5/2022", "content": "If both you and your child enjoy flipping off school employees at the county fair, you might be a bad parent."},
    {"title": "EPIPHANY DAY", "date": "1/6/2022", "content": "If you have argued that the cigarettes found in your daughter’s purse were not hers, but later called the school demanding that her cigarettes be returned to her, you might be a bad parent."}, 
    {"title": "I'M NOT GOING TO TAKE IT ANYMORE DAY", "date": "1/7/2022", "content": "If you tell your son that he may see his picture on the back of a milk carton if he does not straighten up, you might be a bad parent."}, {"title": "SHOW AND TELL DAY AT WORK DAY", "date": "1/8/2022", "content": "If your son’s school science presentation contains bonus footage of you and your spouse doing “the nasty,” you might be a bad parent."}, {"title": "NATIONAL LAW ENFORCEMENT APPRECIATION DAY", "date": "1/9/2022", "content": "If you have asked the question, “Do you want me to take him up to jail or should we let the police do it?” you might be a bad parent."}, {"title": "WOLF MOON DAY", "date": "1/10/2022", "content": "If you blame your child's behavioral issues on phases of the moon, you might be a bad parent."}, {"title": "NATIONAL CLEAN OFF YOUR DESK DAY", "date": "1/11/2022", "content": "If you, or the friend you brought to the suspension hearing, have attempted to steal a witness statement from the assistant principal's desk, you might be a bad parent."}, {"title": "NATIONAL PHARMACISTS DAY", "date": "1/12/2022", "content": "If you are OK with your son's distribution of pills at school because you claim that he has always had a desire to help others, you might be a bad parent."}, {"title": "PUBLIC RADIO BROADCASTING DAY", "date": "1/13/2022", "content": "If you have sent an email to school saying, “The views expressed are solely those of my child and do not reflect the views of her mother or me,” you might be a bad parent."}, {"title": "NATIONAL POTHOLE DAY", "date": "1/14/2022", "content": "If you insist on knowing what happens to the drugs after the expulsion hearing, you might be a bad parent."}, {"title": "HUMANITARIAN DAY", "date": "1/15/2022", "content": "If you have ever asked the question, “Where did I go wrong; I’ve given my son everything?” you might be a bad parent."}, {"title": "NATIONAL GOOD TEEN DAY", "date": "1/16/2022", "content": "If you have referred to the other students in your son’s class as “those snot-nosed bastards,” you might be a bad parent."}, {"title": "ELEMENTARY SCHOOL TEACHER DAY", "date": "1/17/2022", "content": "If two or more teachers have chosen early retirement upon being notified that your son will be in their class next year, you might be a bad parent."}, {"title": "THEAUSAURUS DAY", "date": "1/18/2022", "content": "If your idea of the three “R’s” is “readin’, writin’ and rippin’ the school a new one,” you might be a bad parent."}, {"title": "GUN APPRECIATION DAY", "date": "1/19/2022", "content": "If you publicly state that it is your son’s Second Amendment right to carry a gun in biology class, you might be a bad parent."}, {"title": "CAMCORDER DAY", "date": "1/20/2022", "content": "If your son assaults another student and your only question at the suspension hearing is, “When can I get a recording of the fight?” you might be a bad parent."}, {"title": "SQUIRREL APPRECIATION DAY", "date": "1/21/2022", "content": "If you describe a recent event in which your son brought a ladder to school, removed the roof vent covers, and placed dead animals in the air ducts as a “momentary lapse in judgment,” you might be a bad parent."}, {"title": "NATIONAL BITTERSWEET CHOCOLATE DAY", "date": "1/22/2022", "content": "If you accidentally sent your daughter to school with the wrong brownies, you might be a bad parent."}, {"title": "NATIONAL HANDWRITING DAY", "date": "1/23/2022", "content": "If you argue that your son’s name, written in ink, in his handwriting, on the bus seat in which he is the only rider is evidence of a greater conspiracy, you might be a bad parent."}, {"title": "NATIONAL SANCTITY OF LIFE DAY", "date": "1/24/2022", "content": "If you have made the statement, “So the school just wants her to die!” when your daughter’s cell phone is confiscated by her teacher, you might be a bad parent."}, {"title": "NATIONAL OPPOSITE DAY", "date": "1/25/2022", "content": "If you make the claim that it was actually the valedictorian that cheated off of your son and not vice versa, you might be a bad parent."}, {"title": "SPEAK UP AND SUCCEED DAY", "date": "1/26/2022", "content": "If you threaten to file a lawsuit if the school requires you son to be respectful, you might be a bad parent."}, {"title": "CLASHING CLOTHES DAY", "date": "1/27/2022", "content": "If you make your daughter change clothes before taking her to the newspaper office to request that the paper run an article critical of the school's dress code, you might be a bad parent."}, {"title": "NATIONAL BIG WIG DAY", "date": "1/28/2022", "content": "If you insist that the teachers refer to you as “doctor,” even though it is common knowledge that you never made it past the eighth grade, you might be a bad parent."}, {"title": "FREETHINKERS DAY", "date": "1/29/2022", "content": "If you believe that a “free and public education” entitles you to have teachers come to your house to educate your children, you might be a bad parent."}, {"title": "NATIONAL ESCAPE DAY", "date": "1/30/2022", "content": "If you left your child with twenty dollars and three cans of beans when you left town to join a commune in Minnesota, you might be a bad parent."}, {"title": "BACKWARDS DAY", "date": "1/31/2022", "content": "If you insist that your son does not have to respect his teacher unless, in his opinion, the teacher respects him first, you might be a bad parent."}, {"title": "NATIONAL GET UP DAY", "date": "2/1/2022", "content": "If you have ever called the school to report that you can’t get your child out of bed, or your child has called the school to report that they can't get you out of bed, you might be a bad parent."}, {"title": "SELF RENEWAL DAY", "date": "2/2/2022", "content": "If you have ever asked a teacher to talk to your child and requested that your name be kept out of it, you might be a bad parent."}, {"title": "THE DAY THE MUSIC DIED", "date": "2/3/2022", "content": "If you named your child after a dead rock star, you might be a bad parent."}, {"title": "NATIONAL THANK A MAILMAN DAY", "date": "2/4/2022", "content": "If you know that your son has been intercepting correspondence from the school, but you don’t mind because every time he goes to the mailbox you steal his smokes, you might be a bad parent."}, {"title": "NATIONAL ICE CREAM FOR BREAKFAST DAY", "date": "2/5/2022", "content": "If you take your son to the Dairy Queen directly after he has been suspended from school, you might be a bad parent."}, {"title": "PAY A COMPLIMENT DAY", "date": "2/6/2022", "content": "If your daughter calls the high school principal an a**hole, and you defend the principal by saying, “It's his job to be an a**hole,” you might be a bad parent."}, {"title": "NATIONAL POOP DAY", "date": "2/7/2022", "content": "If you give your son permission to skip science class every day because he refuses to use the school’s toilets, you might be a bad parent."}, {"title": "BOY SCOUTS DAY", "date": "2/8/2022", "content": "If you threaten to enroll your son in another school and the principal immediately hands you a fully completed school withdrawal form for you to sign, you might be a bad parent."}, {"title": "NATIONAL CUT THE CORD DAY", "date": "2/9/2022", "content": "If you have been seen a dozen or more times sneaking into school to bring your son something that he forgot at home, you might be a bad parent."}, {"title": "NATIONAL HOME WARRANTY DAY", "date": "2/10/2022", "content": "If your child has expressed the view that Juvenile Detention is better than being home, you might be a bad parent."}, {"title": "NATIONAL DON'T CRY OVER SPILLED MILK DAY", "date": "2/11/2022", "content": "If you have sprayed breast milk on a police officer in an effort to avoid being arrested for drunk driving, you might be a bad parent."}, {"title": "NATIONAL CRIME PREVENTION DAY", "date": "2/12/2022", "content": "If your daughter enters a new school and you say to the principal, “I know her folder says that she committed three felonies, but if you assault someone that you are robbing, shouldn’t that only count as one?” you might be a bad parent."}, {"title": "GET A DIFFERENT NAME DAY", "date": "2/13/2022", "content": "If you know that the school dress code policy does not permit students to wear shirts promoting alcohol, but you argue that your daughter should be able to wear a Miller Lite shirt in school because her last name is Miller, you might be a bad parent."}, {"title": "VALENTINES DAY", "date": "2/14/2022", "content": "If you are your son’s best friend’s date at the senior prom, you might be a bad parent."}, {"title": "LOVE TEACHERS DAY", "date": "2/15/2022", "content": "If in one grading period you have referred to seven school employees as “those liars,” you might be a bad parent."}, {"title": "NATIONAL INNOVATION DAY", "date": "2/16/2022", "content": "If during a suspension hearing, your son has changed his story three times and your comment each time is, “That’s exactly what happened,” you might be a bad parent."}, {"title": "NATIONAL PTA FOUNDERS DAY", "date": "2/17/2022", "content": "If you claim that you do not have the time to join the PTA, but you have published lengthy editorials in the newspaper criticizing the PTA, you might be a bad parent."}, {"title": "NATIONAL DRINK WINE DAY", "date": "2/18/2022", "content": "If you show up drunk at your son’s expulsion hearing, you might be a bad parent."}, {"title": "PREVENT PLAGIARISM DAY", "date": "2/19/2022", "content": "If you make the statement, “My son did not plagiarize this, he copied it out of a book,” you might be a bad parent."}, {"title": "NATIONAL HANDCUFF DAY", "date": "2/20/2022", "content": "If both you and your son exit the school in handcuffs, you might be a bad parent."}, {"title": "INTERNATIONAL MOTHER LANGUAGE DAY", "date": "2/21/2022", "content": "If during a parent-teacher conference you demonstrate your verbal skills by using the “F” word as a noun, verb, gerund, and descriptive adjective, you might be a bad parent."}, {"title": "RECREATIONAL SPORTS AND FITNESS DAY", "date": "2/22/2022", "content": "If you have been thrown out of your daughter’s sporting event prior to the playing of the national anthem, you might be a bad parent."}, {"title": "INCONVENIENCE YOURSELF DAY", "date": "2/23/2022", "content": "If the school calls to inform you that your son might have broken his leg in gym class and you ask if you should come get him or just let him walk home, you might be a bad parent."}, {"title": "FORGET ME NOT DAY", "date": "2/24/2022", "content": "If you consider needing to get in line early for the big sale at Odd Lots as a valid reason for dropping your five-year-old off at school two hours early, you might be a bad parent."}, {"title": "INTERNATIONAL STAND UP TO BULLYING DAY", "date": "2/25/2022", "content": "If you claim that your daughter has been bullied so often at school that she is unable to leave the house, but later in the conversation reveal that your daughter has not been home in three days, you might be a bad parent."}, {"title": "CARNIVAL DAY", "date": "2/26/2022", "content": "If your fifteen-year-old daughter has chosen to run off with a long-haul trucker, a traveling musician, or a carnival geek, you might be a bad parent."}, {"title": "NO-BRAINER DAY", "date": "2/27/2022", "content": "If you argue that the school is brainwashing your son, but readily admit that it probably would not take a lot of soap, you might be a bad parent."}, {"title": "RARE DISEASE DAY", "date": "2/28/2022", "content": "If in absence of any formal diagnosis, you claim that your tenth-grade son has a medical condition that requires him to be in direct sunlight the entire school day and your expectation is that the school alter the schedules of all of the teachers and students so that your son can stay in the same room all day, you might be a bad parent."}, {"title": "SELF-INJURY AWARENESS DAY", "date": "3/1/2022", "content": "If your son has been thrown out of a game for kicking a referee and you scream from the stands, “That’s my boy,” you might be a bad parent."}, {"title": "OLD STUFF DAY", "date": "3/2/2022", "content": "If your child, who is in high school is older than three of his teachers, you might be a bad parent."}, {"title": "NATIONAL ANTHEM DAY", "date": "3/3/2022", "content": "If you willingly stand for four hours at a NASCAR event, but refuse to stand when the high school band plays the national anthem, you might be a bad parent."}, {"title": "MARCH FORTH DAY", "date": "3/4/2022", "content": "If the only exercise that you get is marching into school, jumping to conclusions, and flying into a rage, you might be a bad parent."}, {"title": "NATIONAL POTTY DANCE DAY", "date": "3/5/2022", "content": "If you are upset that the school will not permit your son to organize dance parties in the school restroom, you might be a bad parent."}, {"title": "NATIONAL DRESS DAY", "date": "3/6/2022", "content": "If you show up shirtless to a school board meeting, you might be a bad parent."}, {"title": "NATIONAL BE HEARD DAY", "date": "3/7/2022", "content": "If you and another mother exchange words in the principal’s office and passers-by cannot distinguish this argument from the one your daughters had fifteen minutes earlier, you might be a bad parent."}, {"title": "NATIONAL BE NASTY DAY", "date": "3/8/2022", "content": "If your head moves horizontally when you make the statement, “Those girls better keep my daughter's name out of their mouth,” you might be a bad parent."}, {"title": "FIND OUT WHAT YOUR NAME MEANS DAY", "date": "3/9/2022", "content": "If everyone believes that the spelling of your daughter’s name is a product of your creativity, when in reality it is evidence that you were drunk when you filled out her birth certificate, you might be a bad parent."}, {"title": "FESTIVAL OF LIFE IN THE CRACKS DAY", "date": "3/10/2022", "content": "If your son's third-grade teacher has discovered contraband items that your son smuggled into school in his butt crack, you might be a bad parent."}, {"title": "PROMPROSAL DAY DREAM DAY", "date": "3/11/2022", "content": "If you sign a form giving your sixteen-year-old daughter permission to attend the prom with her thirty-five-year old boyfriend, you might be a bad parent."}, {"title": "GENEALOGY DAY", "date": "3/12/2022", "content": "If your son has been suspended from school for getting into a fist fight with the son of someone with whom you got into a fist fight when you were in school, you might be a bad parent."}, {"title": "CHECK YOUR BATTERIES DAY", "date": "3/13/2022", "content": "If your third-grade daughter brought one of your sex toys to school for “Show and Tell day,” where she both showed, and told, you might be a bad parent."}, {"title": "FILL OUR STAPLERS DAY", "date": "3/14/2022", "content": "If you have ever asked the question, “What did that teacher do to make my son throw the stapler,” you might be a bad parent."}, {"title": "TRUE CONFESSIONS DAY", "date": "3/15/2022", "content": "If you call a meeting that includes five teachers, three administrators, and a two clergy members to confess that you are the father of your fifteen-year-old stepdaughter’s child, you might be a bad parent."}, {"title": "FREEDOM OF INFORMATION DAY", "date": "3/16/2022", "content": "If you have fled the scene of an accident and left your child and his friends behind to explain to the police your version of what happened, you might be a bad parent."}, {"title": "DOCTOR-PATIENT TRUST DAY", "date": "3/17/2022", "content": "If you have stolen stationary from a doctor’s office to manufacture medical excuses for your children and their friends, you might be a bad parent."}, {"title": "AWKWARD MOMENTS DAY", "date": "3/18/2022", "content": "If your statement, “My children would be better off without me,” is followed by a long, uncomfortable silence, you might be a bad parent."}, {"title": "INTERNATIONAL SPORTS CAR RACING DAY", "date": "3/19/2022", "content": "If you don’t attend your son’s graduation because it conflicts with the Daytona 500, you might be a bad parent."}, {"title": "WORLD STORYTELLING DAY", "date": "3/20/2022", "content": "If you believe your child when he tells you he did not make it to school because a stranger came to the bus stop, drug him into the woods, and put him in a sleeper hold, you might be a bad parent."}, {"title": "NATIONAL COMMON COURTESY DAY", "date": "3/21/2022", "content": "If you feel that it is essential that you inform all of your child’s teachers that you are related to two school board members, you might be a bad parent."}, {"title": "AS YOUNG AS YOU FEEL DAY", "date": "3/22/2022", "content": "If you and your daughter, who is in eighth grade, smoke the same brand of cigarettes and she is old enough to legally buy them, you might be a bad parent."}, {"title": "NEAR MISS DAY", "date": "3/23/2022", "content": "If you have asked the school to find out if your son’s girlfriend is pregnant, you might be a bad parent."}, {"title": "INTERNATIONAL DAY OF ACHIEVERS", "date": "3/24/2022", "content": "If you allow your seven-year old to pack his own lunch, you might be a bad parent."}, {"title": "NO HOMEWORK DAY", "date": "3/25/2022", "content": "If you believe that homework and disrespect are synonyms, you might be a bad parent."}, {"title": "BROTHERS' AND SISTERS' DAY", "date": "3/26/2022", "content": "If you have five children in middle school and each has a different last name, you might be a bad parent."}, {"title": "INTERNATIONAL SCRIBBLE DAY", "date": "3/27/2022", "content": "If during a parent-teacher conference you have made the claim that your son’s poor handwriting is proof that he will someday be a doctor, you might be a bad parent. "}, {"title": "WEED APPRECIATION DAY", "date": "3/28/2022", "content": "If you and your son get the giggles during a parent-teacher conference, you might be a bad parent."}, {"title": "NATIONAL MOM AND POP BUSINESS OWNERS DAY", "date": "3/29/2022", "content": "If your daughter supports the family business by selling weed at school, you might be a bad parent."}, 
    {"title": "GRASS IS ALWAYS BROWNER ON THE OTHER SIDE OF THE FENCE DAY", "date": "3/30/2022", "content": "If you are in the principal’s office with your son who is being handcuffed by the police and you call your wife and tell her, “Honey, they found the stuff,” you might be a bad parent."}, {"title": "NATIONAL “SHE'S FUNNY THAT WAY” DAY", "date": "3/31/2022", "content": "If you claim that your daughter was acting in self-defense when she hit another student for “looking at her funny,” you might be a bad parent."}, {"title": "NATIONAL LOVE FOR OUR CHILDREN DAY", "date": "4/1/2022", "content": "If it is impossible for Children Protective Services to determine the color of the carpet in your son’s room because of the animal feces, you might be a bad parent."}, {"title": "INTERNATIONAL FACT-CHECKING DAY", "date": "4/2/2022", "content": "If you are more interested in whether the school can prove your son vandalized the school locker room than the fact that your son vandalized the school locker room, you might be a bad parent."}, {"title": "WORLD PARTY DAY", "date": "4/3/2022", "content": "If you host drinking parties for your son and his friends, you might be a bad parent."}, {"title": "TELL A LIE DAY", "date": "4/4/2022", "content": "If you make the statement, “I know my son has lied to you sixteen times this year, but this time I’m giving him the benefit of the doubt,” you might be a bad parent."}, {"title": "GO BROKE DAY", "date": "4/5/2022", "content": "If you claim that you don’t have two dollars for your child’s school lunch while sporting a five-dollar pack of cigarettes in your shirt pocket, you might be a bad parent."}, {"title": "NATIONAL STUDENT ATHLETE DAY", "date": "4/6/2022", "content": "If you believe that your twenty-five dollar donation to the athletic booster club should ensure your son a starting position on the football team, you might be a bad parent."}, {"title": "NATIONAL BEER DAY", "date": "4/7/2022", "content": "If you have drunk four or more beers before attending a school open house, you might be a bad parent."}, {"title": "NATIONAL DIVE BAR DAY", "date": "4/8/2022", "content": "If your son has to be picked up from school by a cab because you are picking up men at the local pub, you might be a bad parent."}, {"title": "NATIONAL NAME YOURSELF DAY", "date": "4/9/2022", "content": "If there is a parking space with your name on it at the Juvenile Court House, you might be a bad parent."}, {"title": "ENCOURAGE A YOUNG WRITER DAY", "date": "4/10/2022", "content": "If the principal shows you a threatening note that your son wrote and your reaction is to praise his penmanship, you might be a bad parent."}, {"title": "HOLY MONDAY", "date": "4/11/2022", "content": "If you argue that your son should be permitted to carry snuff (tobacco) in school for religious reasons, you might be a bad parent."}, {"title": "EDUCATION AND SHARING DAY", "date": "4/12/2022", "content": "If your son's teachers express that you son is a bad influence on other students, and your reaction is a smile, you might be a bad parent."}, {"title": "NATIONAL MAKE LUNCH COUNT  DAY", "date": "4/13/2022", "content": "If the lunch that you packed for your child contains three candy bars, a dozen cookies and a Mountain Dew, you might be a bad parent."}, {"title": "EX-SPOUSE DAY", "date": "4/14/2022", "content": "If you and your ex-spouse have requested neutral corners at a parent-teacher conference or you have both blamed your ex-spouse for your child's behavior at separate parent-teacher conferences, you might be a bad parent."}, {"title": "MCDONALD'S DAY", "date": "4/15/2022", "content": "If in a conversation with the truancy officer you continue to claim that your son is sick, home in bed, after he has been retrieved from McDonald's by the truancy officer, you might be a bad parent."}, {"title": "HUSBAND APPRECIATION DAY", "date": "4/16/2022", "content": "If you find it necessary and appropriate to punch your spouse at your son’s high school commencement, you might be a bad parent."}, {"title": "BAT APPRECIATION DAY", "date": "4/17/2022", "content": "If you have gotten into a physical altercation in the stands at your son’s little league game, you might be a bad parent."}, {"title": "INCOME TAX PAY DAY", "date": "4/18/2022", "content": "If you refer to your child as, “our latest tax deduction,” you might be a bad parent."}, {"title": "NATIONAL COIN DAY", "date": "4/19/2022", "content": "If you have embezzled money from more than one school support organizations, you might be a bad parent."}, {"title": "NATIONAL LOOK ALIKE DAY", "date": "4/20/2022", "content": "If your son has been suspended from school and you show up at school wearing the same T-shirt that caused your son to be suspended, you might be a bad parent."}, {"title": "BIG WORD DAY", "date": "4/21/2022", "content": "If you claim that that your daughter is perspiring for greatness, or that she can't attended school because she has an obstricted vowel, or gentle harpes, you might be a bad parent."}, {"title": "MOTHER EARTH DAY", "date": "4/22/2022", "content": "If an administrator has had to stop a meeting to tell your son to be respectful to his mother, you might be a bad parent."}, {"title": "NATIONAL DAY OF PUPPETRY", "date": "4/23/2022", "content": "If you have called the school and allowed your daughter to sit across the room screaming obscenities and telling you what to say next, you might be a bad parent."}, {"title": "NEW KIDS ON THE BLOCK DAY", "date": "4/24/2022", "content": "If your first question when your child enrolls in a new school is, “How many school rules can he break before he gets expelled?” you might be a bad parent."}, {"title": "INTERNATIONAL FINANCIAL INDEPENDENCE DAY", "date": "4/25/2022", "content": "If you make your children attend school for the sole purpose of remaining eligible for their social security benefits, you might be a bad parent."}, {"title": "SCHOOL BUS DRIVERS DAY", "date": "4/26/2022", "content": "If a school bus driver quits every time your family moves to a new part of town, you might be a bad parent."}, {"title": "ADMINISTRATIVE PROFESSIONALS DAY", "date": "4/27/2022", "content": "If you called the school to complain but you have called the wrong school, in the wrong state, but still ask the secretary if she would contact the superintendent on your behalf, you might be a bad parent."}, 
    {"title": "TAKE OUR SONS AND DAUGHTERS TO WORK DAY", "date": "4/28/2022", "content": "If you have moved to a new town and waited six months to enroll your children into the new school, you might be a bad parent."}, {"title": "VIRAL VIDEO DAY", "date": "4/29/2022", "content": "If after viewing a recording of your son fighting in the school cafeteria, your only comment is, “He needs to work on his jab,” you might be a bad parent."}, {"title": "NATIONAL HONESTY DAY", "date": "4/30/2022", "content": "If you encourage your child to fill out a witness statement for an incident that you know your son did not witness, you might be a bad parent."}, {"title": "LAW DAY", "date": "5/1/2022", "content": "If you are not a lawyer, do not work in a courthouse, or in the field of law enforcement but you are on a first name basis with all of the law enforcement officers, judges, and court officials in a three county area, you might be a bad parent."}, {"title": "NATIONAL MEETING PLANNERS APPRECIATION DAY", "date": "5/2/2022", "content": "If you show up late for a meeting that was set up to discuss your son’s chronic tardiness to school, you might be a bad parent."}, {"title": "WORDSMITH DAY", "date": "5/3/2022", "content": "If when asked, you are able to come up with three or more situations in which you believe your child is justified in using the “F” word at school, you might be a bad parent."}, {"title": "ANTI-BULLYING DAY", "date": "5/4/2022", "content": "If you have ever made the statement, “Bullying is a rite of passage,” you might be a bad parent."}, {"title": "HUG A SHED AND TAKE A SELFIE DAY", "date": "5/5/2022", "content": "If you have defended your daughter’s right to take partially clothed “selfies” in the high school restroom and have assisted her in uploading the photos to the internet, you might be a bad parent."}, {"title": "INTERNATIONAL TUBA DAY", "date": "5/6/2022", "content": "If your daughter was suspended from school for “throwing quarters at the tuba player” during a field trip and you appealed the suspension because she claims she was, “tossing” not throwing; “nickels,” not quarters; at the “saxophone” player not the tuba player, you might be a bad parent."}, {"title": "NATIONAL BABYSITTER'S DAY", "date": "5/7/2022", "content": "If no one in you town will agree to babysit your children, you might be a bad parent."}, {"title": "MOTHER'S DAY", "date": "5/8/2022", "content": "If you have made the statement, “We provided the sperm and the egg, the rest is pretty much up to the school,” you might be a bad parent."}, {"title": "TEAR THE TAGS OFF THE MATTRESS DAY", "date": "5/9/2022", "content": "If the administrator tells you it is not the school’s job to get your son out of bed every morning and you turn to your wife and say, “See, I told you this f*** ing school wouldn’t do anything for us,” you might be a bad parent. "}, {"title": "CLEAN UP YOUR ROOM DAY", "date": "5/10/2022", "content": "If you have ever asked the question, “Does my son’s probation officer have the right to look under his bed?” you might be a bad parent."}, {"title": "INTERNATIONAL RECEPTIONISTS' DAY", "date": "5/11/2022", "content": "If the picture of you posted by the school receptionist’s phone has an attached note saying, “If you see this man, call 911 immediately,” you might be a bad parent."}, {"title": "ODOMETER DAY", "date": "5/12/2022", "content": "If you have left a broken down vehicle in a school parking lot for more than seven months, you might be a bad parent."}, {"title": "BLAME SOMEONE ELSE DAY", "date": "5/13/2022", "content": "If your child has been unsuccessful in a dozen different school districts and you really believe that it is the teacher's fault, you might be a bad parent."}, {"title": "STAY UP ALL NIGHT NIGHT", "date": "5/14/2022", "content": "If your child cannot stay awake in school because you allow him to play X box all night, you might be a bad parent."}, {"title": "INTERNATIONAL DAY OF FAMILIES", "date": "5/15/2022", "content": "If you request that the school schedule both of your children’s expulsion hearings on the same day, you might be a bad parent."}, {"title": "NATIONAL WEAR PURPLE FOR PEACE DAY", "date": "5/16/2022", "content": "If you encourage your son to confront adults, you might be a bad parent."}, {"title": "INTERNATIONAL DAY AGAINST HOMOPHOBIA, BIPHOBIA AND TRANSPHOBIA", "date": "5/17/2022", "content": "If you claim that your son is not racist because he hates everyone equally, you might be a bad parent."}, {"title": "DISCOVERY DAY", "date": "5/18/2022", "content": "If you do not have the ability to differentiate between hearsay and eyewitness testimony, you might be a bad parent."}, {"title": "BROWN BAG IT THURSDAY", "date": "5/19/2022", "content": "If you have intentionally included, in your child’s school lunch, a beverage containing alcohol, you might be a bad parent."}, {"title": "WORLD BEE DAY", "date": "5/20/2022", "content": "If you have missed a graduation, a sporting event, and/or a spelling bee in which you son or daughter has been prominently featured, because you were in county lockup, you might be a bad parent."}, {"title": "CULTURE FREEDOM DAY", "date": "5/21/2022", "content": "If you have shared a jail cell with your high school-aged son, you might be a bad parent."}, {"title": "NATIONAL FALLS PREVENTION AWARENESS DAY", "date": "5/22/2022", "content": "If you have told your son to “suck it up,” when he complains that he is hurt and later find that he has a broken leg, you might be a bad parent"}, {"title": "LUCKY PENNY DAY", "date": "5/23/2022", "content": "If you have paid your child’s school fees in pennies for the sole purpose of pissing off the school secretary, you might be a bad parent."}, {"title": "BROTHER'S DAY", "date": "5/24/2022", "content": "If you have threatened to bring your brother into school to help you kick the principal’s ass, you might be a bad parent."}, {"title": "TOWEL DAY", "date": "5/25/2022", "content": "If your son's gym class towel says, “Holiday Inn,” you might be a bad parent."}, 
    {"title": "WORLD DRACULA DAY", "date": "5/26/2022", "content": "If you claim that the only time that you are available to meet with your son’s teachers is 11:00 pm on Sunday night, you might be a bad parent."}, {"title": "NOTHING TO FEAR DAY", "date": "5/27/2022", "content": "If the school goes into an Emergency Lock Down Mode every time you pull into the parking lot, you might be a bad parent."}, {"title": "MENSTRUAL HYGIENE DAY", "date": "5/28/2022", "content": "If your daughter has missed over one hundred days of school and your explanation to the truancy officer is, “Her menstrual cycle is very unpredictable,” you might be a bad parent."}, {"title": "INTERNATIONAL DAY OF UNITED NATIONS PEACEKEEPERS", "date": "5/29/2022", "content": "If you have asked the school if a security guard could follow your daughter around the school all day to make sure that no one was being mean to her, you might be a bad parent."}, {"title": "NATIONAL CREATIVITY DAY", "date": "5/30/2022", "content": "If your son is in trouble at school and you encourage him to flea bargain, you might be a bad parent."}, {"title": "SPEAK IN COMPLETE SENTENCES DAY", "date": "5/31/2022", "content": "If in the same conversation you have screamed at an administrator for calling you too early in the day and for not calling you sooner, you might be a bad parent."}, {"title": "INTERNATIONAL CHILDREN'S DAY", "date": "6/1/2022", "content": "If you get confused when explaining to the principal which of your children is in which correctional facility, you might be a bad parent."}, {"title": "NATIONAL LEAVE THE OFFICE EARLY DAY", "date": "6/2/2022", "content": "If you have embarrassed yourself so badly in the outer office area of the school that you ask the assistant principal if there is a back door out of his office, you might be a bad parent."}, {"title": "NATIONAL GUN VIOLENCE AWARENESS DAY", "date": "6/3/2022", "content": "If you have felt it necessary to take a weapon to a parent-teacher conference, you might be a bad parent."}, {"title": "SHOPPING CART DAY", "date": "6/4/2022", "content": "If you have claimed that a shopping trip should be excused as a family emergency, you might be a bad parent."}, {"title": "FESTIVAL OF POPULAR DELUSIONS DAY", "date": "6/5/2022", "content": "If you believe that lying for your child is helping him achieve long-term success, you might be a bad parent."}, {"title": "NATIONAL HIGHER EDUCATION DAY", "date": "6/6/2022", "content": "If you describe your daughter’s suspension from school for possession of marijuana as “taking one for the team,” you might be a bad parent."}, {"title": "VCR DAY", "date": "6/7/2022", "content": "If you claim your son is innocent even after viewing camera footage of your son breaking into a locker, you might be a bad parent."}, {"title": "BEST FRIENDS DAY", "date": "6/8/2022", "content": "If you have made the statement, “My daughter and I are really just good friends,” you might be a bad parent."}, {"title": "TEACHER THANK YOU DAY", "date": "6/9/2022", "content": "If you believe that a dozen teachers in six different school districts have conspired against your child, you might be a bad parent."}, {"title": "RANDOM ACT OF DUMBNESS DAY", "date": "6/10/2022", "content": "If there is a problem with your son’s schedule and you call the State Department of Education to complain prior to calling your son’s school, you might be a bad parent."}, {"title": "DIRTY BOOK DAY", "date": "6/11/2022", "content": "If your son is caught in school with a memory stick that contains an array of over one hundred pictures of nude women and you believe that someone else put the pictures there, you might be a bad parent."}, {"title": "NATIONAL CHILDREN'S DAY", "date": "6/12/2022", "content": "If you justify your child’s misbehavior by citing the misbehavior of other children, you might be a bad parent."}, {"title": "RANDOM ACTS OF LIGHT DAY", "date": "6/13/2022", "content": "If in an expulsion hearing you have asked the question, “Can I at least have the lighter back?” you might be a bad parent."}, {"title": "OWN YOUR SHARE OF AMERICA DAY", "date": "6/14/2022", "content": "If you use the, “I am a taxpayer,” argument to explain why you parked in the school fire lane, you might be a bad parent."}, {"title": "NATIVE AMERICAN CITIZENSHIP DAY", "date": "6/15/2022", "content": "If you claim that the hatchet your son brought to school is part of his Native American heritage, you might be a bad parent."}, {"title": "NO ORANGE CLOTHES DAY", "date": "6/16/2022", "content": "If you have had to bail your daughter out of jail to attend her high school graduation, you might be a bad parent."}, 
    {"title": "NATIONAL FLIP FLOP DAY", "date": "6/17/2022", "content": "If you have forged a podiatrist's note so that your child could wear footwear prohibited by the student handbook, you might be a bad parent."}, {"title": "WORLD JUGGLING DAY", "date": "6/18/2022", "content": "If your daughter has a track meet, your son has a volleyball match, and you go to a strip club, you might be a bad parent."}, {"title": "HUSBAND CAREGIVER DAY", "date": "6/19/2022", "content": "If you authorize your ex-husband’s cousin’s friend, whom you have never met, to pick up your eight-year-old at school, you might be a bad parent."}, {"title": "NEW IDENTITY DAY", "date": "6/20/2022", "content": "If you ask the guidance counselor at the new school not to call the guidance counselor at the old school, you might be a bad parent."}, {"title": "GO SKATEBOARDING DAY", "date": "6/21/2022", "content": "If your child is too sick to attend school during the day but is well enough to be at the skate park in the evening, you might be a bad parent."}, {"title": "STUPID GUY THING DAY", "date": "6/22/2022", "content": "If you have referred to your son as, “that moron,” during a parent-teacher conference in which he is in attendance, you might be a bad parent."}, {"title": "NATIONAL HYDRATION DAY", "date": "6/23/2022", "content": "If you were the one who spiked the punch at Meet the Teacher Night, you might be a bad parent."}, {"title": "MIDSUMMER DAY", "date": "6/24/2022", "content": "If you describe summer school as a four-week vacation from your children, you might be a bad parent."}, {"title": "NATIONAL POLICE COMMUNITY COOPERATIVE DAY", "date": "6/25/2022", "content": "If you have ever asked a school official to lie to the police on behalf of your child, you might be a bad parent."}, {"title": "AMERICA'S KIDS DAY", "date": "6/26/2022", "content": "If you have asked the school to call a student, other than your own child, to the office for the purpose of “reaming them out,” you might be a bad parent."}, {"title": "INDUSTRIAL WORKERS OF THE WORLD DAY", "date": "6/27/2022", "content": "If you take a new job in a new town but do not take your old children from the old town, you might be a bad parent."}, {"title": "INSURANCE AWARENESS DAY", "date": "6/28/2022", "content": "If your last words at a parent-teacher conference are, “Before you fail my son, remember, I know where every one of you lives,” you might be a bad parent."}, {"title": "NATIONAL CAMERA DAY", "date": "6/29/2022", "content": "If you have accused the school of altering security camera footage to incriminate your child, you might be a bad parent."}, {"title": "SOCIAL MEDIA DAY", "date": "6/30/2022", "content": "If your Facebook account contains footage of one or more of your children participating in a fight, you might be a bad parent."}, {"title": "EARLY BIRD DAY", "date": "7/1/2022", "content": "If you have used the, \"But she flipped me off first,\" defense, you might be a bad parent."}, {"title": "WORLD SPORTS JOURNALISTS DAY", "date": "7/2/2022", "content": "If you encourage your child to use his knowledge of WWE wrestling holds on the school wrestling team, you might be a bad parent."}, {"title": "AMERICAN REDNECK DAY", "date": "7/3/2022", "content": "If you have hidden behind the scoreboard at your son’s football game with the intention of clubbing the opposing players as they go to the locker room at halftime, you might be a bad parent."}, {"title": "INDEPENDENCE DAY", "date": "7/4/2022", "content": "If you have told your son’s guidance counselor that you believe that a fifteen-year-old is mature enough to live on his own, you might be a bad parent."}, {"title": "MECHANICAL PENCIL DAY", "date": "7/5/2022", "content": "If you present to the school a new plan for busing students that you and your buddy wrote on the back of a bar napkin, you might be a bad parent."}, {"title": "NUDE RECREATION DAY", "date": "7/6/2022", "content": "If your son is busted at school for distributing inappropriate pictures with his cell phone and you express disappointment that he didn’t share them with you, you might be a bad parent."}, {"title": "TELL THE TRUTH DAY", "date": "7/7/2022", "content": "If you stick by your son’s story even though it is in contradiction to the forty-five other students who were on the school bus, you might be a bad parent."}, 
    {"title": "BE A KID AGAIN DAY", "date": "7/8/2022", "content": "If you have demanded that the school allow you to perform with the school's marching band during the homecoming parade, you might be a bad parent."}, {"title": "NATIONAL NO BRA DAY", "date": "7/9/2022", "content": "If you have ever called the school to make the claim that your daughter's breasts are too large to fit in school appropriate clothing, you might be a bad parent."}, {"title": "BARN DAY", "date": "7/10/2022", "content": "If you believe that it is your right to house your horses in the school gymnasium because you are a taxpayer and your barn burned down, you might be a bad parent."}, {"title": "INTERNATIONAL TOWN CRIERS DAY", "date": "7/11/2022", "content": "If the principal has called to report that your son is failing and your reply is, “What do you expect me to do about it?” you might be a bad parent."}, {"title": "NEW CONVERSATIONS DAY", "date": "7/12/2022", "content": "If you refuse to answer the phone because your caller ID indicates that the incoming call is from the school, you might be a bad parent."}, {"title": "NATIONAL FRENCH FRY DAY", "date": "7/13/2022", "content": "If you encourage your son, who can barely speak English, to take a French class because you are single, the French teacher is hot, and you intend to put the moves on her at a parent-teacher conference, you might be a bad parent."}, {"title": "NATIONAL TAPE MEASURE DAY", "date": "7/14/2022", "content": "If you have asked your brother to put a chalk line one hundred feet from the front door of the school so you can be in full compliance with the restraining order, you might be a bad parent."}, {"title": "GUMMI WORM DAY", "date": "7/15/2022", "content": "If your son is busted for stealing and you argue that having a vending machine in school is a form of entrapment, you might be a bad parent."}, {"title": "TOSS AWAY THE “COULD HAVES” AND “SHOULD HAVES” DAY", "date": "7/16/2022", "content": "If in a suspension hearing your son admits that he tried to buy drugs at school but did not have enough money, and you exclaim, “See, I told you he was innocent,” you might be a bad parent."}, {"title": "WORLD DAY FOR INTERNATIONAL JUSTICE", "date": "7/17/2022", "content": "If every conversation that you have with a school principal begins with the question, “And what punishment did the other kid get?” you might be a bad parent."}, {"title": "PERFECT FAMILY DAY", "date": "7/18/2022", "content": "If you have moved your family to a new school district because it is closer to a Juvenile Detention Facility, you might be a bad parent."}, {"title": "NEW FRIENDS DAY", "date": "7/19/2022", "content": "If you sent your daughter to school with scissors so she could cut the heads off of her former friend’s locker pictures, you might be a bad parent."}, {"title": "MOON DAY", "date": "7/20/2022", "content": "If your screen saver is a picture of your child mooning the crowd at the school Christmas program, you might be a bad parent."}, {"title": "LEGAL DRINKING AGE DAY", "date": "7/21/2022", "content": "If you have inadvertently included, in your child’s lunchbox, a beverage containing alcohol, you might be a bad parent."}, {"title": "NATIONAL RATCATCHER'S DAY", "date": "7/22/2022", "content": "If you are more focused on who told on your son than what your son did, you might be a bad parent."}, {"title": "YADA YADA YADA DAY", "date": "7/23/2022", "content": "If you have used the answer “nun ya” on any official school form, you might be a bad parent."}, {"title": "PARENTS' DAY", "date": "7/24/2022", "content": "If you have a desire to be known as “the cool parent,” you might be a bad parent."}, {"title": "NATIONAL WINE AND CHEESE DAY", "date": "7/25/2022", "content": "If you email the principal at midnight on Sunday and leave a voice mail on the superintendent’s phone 6:00 am Monday morning complaining that no one at the school is responding to your concerns, you might be a bad parent."}, {"title": "ONE VOICE DAY", "date": "7/26/2022", "content": "If you organize a group to protest your son’s expulsion from school and even your family doesn’t show up, you might be a bad parent."}, {"title": "TAKE YOUR HOUSEPLANTS FOR A WALK DAY", "date": "7/27/2022", "content": "If you made the statement, “I don’t know where my son got the marijuana,” three days before law enforcement raids your home and finds 500 pot plants in your basement, you might be a bad parent."}, {"title": "MILK CHOCOLATE DAY", "date": "7/28/2022", "content": "If you blame your son's failure of math on a sugar imbalance, you might be a bad parent."}, {"title": "NATIONAL CUT YOUR ENERGY COSTS DAY", "date": "7/29/2022", "content": "If Children Protective Services, the school truancy officer and the assistant principal have your phone number on speed dial, you might be a bad parent."}, {"title": "NATIONAL SUPPORT PUBLIC EDUCATION DAY", "date": "7/30/2022", "content": "If you feel obligated to continually remind school teachers that you pay their salaries, you might be a bad parent."}, {"title": "NATIONAL DAY OF LAMENT", "date": "7/31/2022", "content": "If you have made the statement, “I don’t know who taught my daughter that ‘f***ing’ bad language,” you might be a bad parent."}, {"title": "RESPECT FOR PARENTS DAY", "date": "8/1/2022", "content": "If you have permitted your daughter to be openly disrespectful toward her teachers and now you are upset because she is using the same strategy on you, you might be a bad parent."}, 
    {"title": "TAKE A PENNY LEAVE A PENNY", "date": "8/2/2022", "content": "If you have stolen something while attending a school open house, a school board meeting, or a parent-teacher conference, you might be a bad parent."}, {"title": "GRAB SOME NUTS DAY", "date": "8/3/2022", "content": "If you have ever made the statement, “But my son likes to yell the word ‘penis’ while running down the hall,\" you might be a bad parent."}, {"title": "NATIONAL THE COAST IS CLEAR DAY", "date": "8/4/2022", "content": "If you have been the lookout while your child was committing a crime, or your child has been the lookout while you were committing a crime, you might be a bad parent."}, {"title": "NATIONAL UNDERWEAR DAY", "date": "8/5/2022", "content": "If you arrive at school wearing a skirt shorter than the one your daughter is being sent home for wearing, you might be a bad parent."}, {"title": "TAXPAYER APPRECIATION DAY", "date": "8/6/2022", "content": "If you have refused to pay your child’s school fees citing that you are a taxpayer, you might be a bad parent."}, {"title": "AMERICAN FAMILY DAY", "date": "8/7/2022", "content": "If everyone at your family reunion has a “the first time I was expelled from school,” story, you might be a bad parent."}, {"title": "NATIONAL DOLLAR DAY", "date": "8/8/2022", "content": "If you hold the belief that teachers went into the field of education for the money, you might be a bad parent."}, {"title": "NATIONAL HAND HOLDING DAY", "date": "8/9/2022", "content": "If you have listed your probation officer as, “other responsible adult,” on your child’s emergency medical contact card, you might be a bad parent."}, {"title": "NATIONAL LAZY DAY", "date": "8/10/2022", "content": "If your child goes without lunch at school, not because you are too proud to accept charity but because you are too lazy to fill out the free lunch form, you might be a bad parent."}, {"title": "PRESIDENTIAL JOKE DAY", "date": "8/11/2022", "content": "If you have made the statement, “If I was the president of the school board,” and everyone in the room laughs so hard that you can’t finish your sentence, you might be a bad parent."}, {"title": "BASEBALL FANS DAY", "date": "8/12/2022", "content": "If your son’s little league coach does not know what you look like, you might be a bad parent."}, {"title": "NATIONAL BOWLING DAY", "date": "8/13/2022", "content": "If you believe that, “Attending a ten day bowling tournament with Uncle Roy” should be considered an excused absence from school, you might be a bad parent."}, {"title": "NATIONAL FINANCIAL AWARENESS DAY", "date": "8/14/2022", "content": "If you use the justification, “boys will be boys,” when your son and his buddies are caught beating up fifth-graders for their lunch money, you might be a bad parent."}, {"title": "STAY HOME WITH YOUR KIDS DAY", "date": "8/15/2022", "content": "If you have permitted your son to stay home from school as a reward for good behavior or good grades, you might be a bad parent."}, {"title": "NATIONAL ROLLER COASTER DAY", "date": "8/16/2022", "content": "If you claim that it is your child’s constitutional right to go to an amusement park on a school day, you might be a bad parent."}, {"title": "BABY BOOMER RECOGNITION DAY", "date": "8/17/2022", "content": "If you have tried to hide contraband in your child’s diaper, you might be a bad parent."}, {"title": "BIRTH CONTROL PILLS DAY", "date": "8/18/2022", "content": "If you have ever asked if it was possible for the school to give your daughter a pregnancy test, you might be a bad parent."}, {"title": "NATIONAL MEN'S GROOMING DAY", "date": "8/19/2022", "content": "If you and your son have identical blue Mohawk haircuts, ankle monitors, and matching swastika tattoos, you might be a bad parent."}, 
    {"title": "INTERNATIONAL HOMELESS ANIMALS' DAY", "date": "8/20/2022", "content": "If you and several other cheerleader moms have gotten into a cat-fight beside the opposing team’s bus at a football game, you might be a bad parent."}, {"title": "GOD'S PREEMINENCE DAY", "date": "8/21/2022", "content": "If you utter the words, “Keep the faith,” as your son is hauled out of school in handcuffs, you might be a bad parent."}, {"title": "NATIONAL TOOTH FAIRY DAY", "date": "8/22/2022", "content": "If you have been overheard stating that brushing teeth is optional at your house, you might be a bad parent."}, {"title": "NATIONAL CHEAP FLIGHT DAY", "date": "8/23/2022", "content": "If you explain that you can't afford to pay your son’s athletic participation fee directly after you show the principal pictures from your recent vacation in Europe, you might be a bad parent."}, {"title": "INTERNATIONAL DAY AGAINST INTOLERANCE, DISCRIMINATION AND VIOLENCE BASED ON MUSICAL PREFERENCES, LIFESTYLE AND DRESS CODE", "date": "8/24/2022", "content": "If you are a bra-less, fifty-year-old mother who arrives at school wearing an, “Austin 3:16 T-shirt,” with cut off sleeves, to discuss the high school dress code, you might be a bad parent."}, {"title": "NATIONAL SECOND-HAND WARDROBE DAY", "date": "8/25/2022", "content": "If you stand by your daughter’s claim of innocence even though she is in possession of the stolen money, listening to the stolen I Pod, and wearing the stolen jeans when you arrive at school, you might be a bad parent."}, {"title": "WOMEN'S EQUALITY DAY", "date": "8/26/2022", "content": "If you openly admit that your daughter never tells the truth but are still willing to use her words to angrily quote verbatim what your daughter says a teacher said to her, you might be a bad parent."}, {"title": "SPEAK KIND WORDS SATURDAY", "date": "8/27/2022", "content": "If in a meeting with the principal you nod in agreement when your son says, “These f***ing teachers suck,” you might be a bad parent."}, {"title": "NATIONAL WEED OUT THE HATE DAY", "date": "8/28/2022", "content": "If your child feels obligated to go back to the principal’s office to apologize for your actions after you have left the school, you might be a bad parent."}, {"title": "INDIVIDUAL RIGHTS DAY", "date": "8/29/2022", "content": "If you tell your daughter not to answer the principal’s question on the grounds that it might incriminate you, you might be a bad parent."}, {"title": "NATIONAL GRIEF AWARENESS DAY", "date": "8/30/2022", "content": "If you are the only one in the meeting that does not realize that your daughter is being a disrespectful, prima donna, you might be a bad parent."}, {"title": "LOVE LITIGATING LAWYERS DAY", "date": "8/31/2022", "content": "If every conversation you have with a school employee ends with the phrase, “You’ll be hearing from my attorney,” you might be a bad parent."}, {"title": "NO RHYME OR REASON DAY", "date": "9/1/2022", "content": "If you have asked the assistant principal to show you in the student handbook where it says that if a student is not in school they will be counted absent, you might be a bad parent."}, {"title": "BRING YOUR MANNERS TO WORK DAY", "date": "9/2/2022", "content": "If you argue that your son was not “chasing” another student but rather, “running really fast right behind” another student, you might be a bad parent."}, {"title": "INTERNATIONAL ENTHUSIASM DAY", "date": "9/3/2022", "content": "If you describe your child’s fourteen tardies in the first month of school as a pretty darn good start compared to last year, you might be a bad parent."}, {"title": "PET ROCK DAY", "date": "9/4/2022", "content": "If you try to organize a group of parents to throw rocks at the opposing players at your son’s football game, you might be a bad parent."}, 
    {"title": "NATIONAL BE LATE FOR SOMETHING DAY", "date": "9/5/2022", "content": "If your child arrives late to school with the excuse, “Dad ran over mom again,” you might be a bad parent."}, {"title": "TELEPHONE TUESDAY", "date": "9/6/2022", "content": "If you call the school to make an anonymous complaint and the secretary recognizes your voice, you might be a bad parent."}, {"title": "NATIONAL NEITHER SNOW NOR RAIN DAY", "date": "9/7/2022", "content": "If you describe an event in which your son used a homemade explosive device to blow up his basketball coach’s mailbox as a harmless prank, you might be a bad parent."}, {"title": "NATIONAL PLEDGE OF ALLEGIANCE DAY", "date": "9/8/2022", "content": "If your child can recite the Miranda Warning but cannot remember the words of the Pledge of Allegiance, you might be a bad parent."}, {"title": "TESTER'S DAY", "date": "9/9/2022", "content": "If the only test you passed in high school was a pregnancy test, you might be a bad parent."}, {"title": "SWAP IDEAS DAY", "date": "9/10/2022", "content": "If you are doing your son’s homework and he is still failing the class, you might be a bad parent. "}, {"title": "NATIONAL GRANDPARENTS DAY", "date": "9/11/2022", "content": "If there are seven or more notes on file excusing your son from being in school because he was “attending his grandmother's funeral,” you might be a bad parent."}, {"title": "NATIONAL VIDEO GAME DAY", "date": "9/12/2022", "content": "If you encourage your child to play video games instead of doing homework, you might be a bad parent."}, {"title": "POSITIVE THINKING DAY", "date": "9/13/2022", "content": "If you have purposely kept your emotionally disabled child up all night for the sole purpose of disrupting the morning special education meeting, you might be a bad parent."}, {"title": "NATIONAL LIVE CREATIVE DAY", "date": "9/14/2022", "content": "If you have attempted to use the “sticks and stones” defense after your daughter verbally abused her teacher, you might be a bad parent."}, {"title": "NATIONAL ONLINE LEARNING DAY", "date": "9/15/2022", "content": "If you make the statement, “The teacher at his last school sucked,” and later your son reveals that he was home schooled last year, you might be a bad parent."}, {"title": "WORKING PARENTS DAY", "date": "9/16/2022", "content": "If you call the school to report that your son is taking a “personal” day, you might be a bad parent."}, {"title": "CONSTITUTION DAY", "date": "9/17/2022", "content": "If you believe that it is your daughter’s constitutionally protected right to use her cell phone anytime and anywhere she chooses, you might be a bad parent."}, {"title": "NATIONAL WIFE APPRECIATION DAY", "date": "9/18/2022", "content": "If you and your spouse have driven by a teacher who is jogging and you said, “You missed her honey, but I got her with the door,” you might be a bad parent."}, {"title": "NATIONAL WOMAN ROAD WARRIOR DAY", "date": "9/19/2022", "content": "If your eighth-grade daughter ditches school, leaves the state with a stranger, and you believe that grounding her for two weeks is the appropriate consequence, you might be a bad parent."}, {"title": "TAKE A LOVED ONE TO THE DOCTOR DAY", "date": "9/20/2022", "content": "If you have altered a doctor’s note to extend your child’s number of days excused from attending school, you might be a bad parent."}, {"title": "INTERNATIONAL DAY OF PEACE", "date": "9/21/2022", "content": "If you have received restraining orders from four ex-wives, or more than two public schools, you might be a bad parent."}, {"title": "ESCAPOLOGY DAY", "date": "9/22/2022", "content": "If on the day your family moves out of the district the teachers have an all-night party, you might be a bad parent."}, {"title": "LOVE NOTE DAY", "date": "9/23/2022", "content": "If your child has left a threatening note, that you have written, on a teacher’s car, or you have placed a threatening note, that your child has written, on a teacher’s car you might be a bad parent."}, {"title": "NATIONAL BLUEBIRD OF HAPPINESS DAY", "date": "9/24/2022", "content": "If you have knocked more than four items off the assistant principal’s wall while slamming a door, you might be a bad parent."}, {"title": "DAUGHTER'S DAY", "date": "9/25/2022", "content": "If you have made the statement, “My daughter was not in trouble at all in her last school, you can call her probation officer,” you might be a bad parent."}, {"title": "NATIONAL COMPLIANCE DAY", "date": "9/26/2022", "content": "If you insist that your child is not being non-compliant, he is just refusing to do what the teacher is telling him to do, you might be a bad parent."}, {"title": "NATIONAL CRUSH A CAN DAY", "date": "9/27/2022", "content": "If you are more focused on what type of beer your son had on the school bus than the fact that your son had beer on the school bus, you might be a bad parent."}, {"title": "INTERNATIONAL RIGHT TO KNOW DAY", "date": "9/28/2022", "content": "If you ask the guidance counselor if he would ask around to find out if your son has an STD, you might be a bad parent."}, {"title": "CONFUCIUS DAY", "date": "9/29/2022", "content": "If your son is being suspended for stealing and your words of wisdom are, “Don’t you know better than to steal during the day,” you might be a bad parent."}, {"title": "ASK A STUPID QUESTION DAY", "date": "9/30/2022", "content": "If you have asked the question, “Will a felony conviction keep me from being a bus monitor,” you might be a bad parent."}, {"title": "INTERNATIONAL RACCOON AWARENESS DAY", "date": "10/1/2022", "content": "If you have attended a school board meeting while in possession of a flask, a gun, or a coon dog, you might be a bad parent."}, {"title": "INTERGENERATION DAY", "date": "10/2/2022", "content": "If both you and your child describe tenth grade as the worst three years of your life, you might be a bad parent."}, {"title": "MEAN GIRLS APPRECIATION DAY", "date": "10/3/2022", "content": "If you request that your daughter be permitted to start a “mean girl’s club” at the school, you might be a bad parent."}, {"title": "NATIONAL GOLF DAY", "date": "10/4/2022", "content": "If you kicked your son's golf ball back into the fairway at a school golf tournament, you might be a bad parent."}, {"title": "DO SOMETHING NICE DAY", "date": "10/5/2022", "content": "If the little league coach offers to bring your son home after practice and you ask if he would mind picking up a few things for you at the grocery store, you might be a bad parent."}, {"title": "NATIONAL COACHES DAY", "date": "10/6/2022", "content": "If you have had two or more coaches in a headlock after a sporting event, you might be a bad parent."}, {"title": "MANUFACTURING DAY", "date": "10/7/2022", "content": "If the only award that the teachers can come up with for your daughter is, “most truth-challenged student in the third grade,” you might be a bad parent."}, {"title": "NATIONAL KIDS BOWL FREE DAY", "date": "10/8/2022", "content": "If you have refused to pay your child’s school fees citing that public education is supposed to be free, you might be a bad parent."}, {"title": "FIRE PREVENTION DAY", "date": "10/9/2022", "content": "If your last words as you exit the school are, “This place will burn,” you might be a bad parent."}, {"title": "NATIONAL LOVE YOUR HAIR DAY", "date": "10/10/2022", "content": "If your son is named after a 1980’s hair band, you might be a bad parent."}, {"title": "NATIONAL KICK-BUTT DAY", "date": "10/11/2022", "content": "If you have driven your son to someone’s house so that he can fight, you might be a bad parent."}, {"title": "OLD FARMERS DAY", "date": "10/12/2022", "content": "If you have driven a lawn tractor to a meeting at school, you might be a bad parent."}, {"title": "NATIONAL TAKE YOUR PARENTS TO LUNCH DAY", "date": "10/13/2022", "content": "If in the same conversation you claim that the food at the school is not fit for humans and that the portions are too small, you might be a bad parent."}, {"title": "WORLD EGG DAY", "date": "10/14/2022", "content": "If you have ever joined your child and his friends to throw eggs at a teacher’s house, you might be a bad parent."}, {"title": "NATIONAL BOSS DAY", "date": "10/15/2022", "content": "If you and or your child has ever made the statement, “You’re not the boss of me,” to a superintendent of schools, you might be a bad parent."}, {"title": "NATIONAL DICTIONARY DAY", "date": "10/16/2022", "content": "If you have found it necessary to ask the school resource officer to define the word assault, you might be a bad parent."}, {"title": "WORLD TRAUMA DAY", "date": "10/17/2022", "content": "If you have ever asked the question, “Exactly how hard did he hit the teacher?” in more than one suspension hearing, you might be a bad parent."}, {"title": "INFORMATION OVERLOAD AWARENESS DAY", "date": "10/18/2022", "content": "If you have made a lengthy dissertation at a BOE meeting concerning the adverse effects of the dual busing policy on your child, only to be informed that the school board ended dual busing years ago, you might be a bad parent."}, {"title": "EVALUATE YOUR LIFE DAY", "date": "10/19/2022", "content": "If you spend the entire parent-teacher conference discussing your life, your problems, and your failures, you might be a bad parent."}, {"title": "NATIONAL DAY OF WRITING", "date": "10/20/2022", "content": "If you have referred to your child, who writes with both hands, as, “amphibian,” you might be a bad parent."}, {"title": "CHECK YOUR MEDS DAY", "date": "10/21/2022", "content": "If you have made the statement, \"I will give my daughter drugs but I refuse to take her to a psychologist,\" you might be a bad parent."}, {"title": "SMART IS COOL DAY", "date": "10/22/2022", "content": "If your approval of your son's detention is contingent on the school admitting that your son is smarter than his teachers, you might be a bad parent."}, {"title": "EVENT ORGANIZERS DAY", "date": "10/23/2022", "content": "If you have asked the question, “Does the restraining order keep me from attending the expulsion hearing,” you might be a bad parent."}, {"title": "NATIONAL CRAZY DAY", "date": "10/24/2022", "content": "If you have tried to use a school bus as public transportation or asked if you could borrow a school bus for a few hours, you might be a bad parent."}, {"title": "ACCOUNTING DAY", "date": "10/25/2022", "content": "If you wait until the day of your son's graduation and you are angry that the high school secretary cannot explain each individual fee your son has accumulated over the past twelve years of his school career, you might be a bad parent."}, {"title": "HORSELESS CARRIAGE DAY", "date": "10/26/2022", "content": "If your eighth grader needs money for a school parking pass, you might be a bad parent."}, {"title": "AMERICAN BEER DAY", "date": "10/27/2022", "content": "If you have showed up drunk to umpire your son’s baseball game, you might be a bad parent."}, {"title": "SEPARATION OF CHUCH AND STATE DAY", "date": "10/28/2022", "content": "If you have made the argument that the school should consider the first day of deer hunting season a religious holiday, you might be a bad parent."}, {"title": "NATIONAL BANDANA DAY", "date": "10/29/2022", "content": "If you show up at your son’s suspension hearing wearing the same gang dew rag that your child was suspended for wearing, you might be a bad parent."}, {"title": "NATIONAL PUBLICIST DAY", "date": "10/30/2022", "content": "If on your family vehicle you proudly display a, “My son beat up your Honor Roll student,” bumper sticker, you might be a bad parent."}, {"title": "R.E.A.D IN AMERICA DAY", "date": "10/31/2022", "content": "If you believe that, “Having the answer key to all tests two days prior to the test,” is a clause that should be included in your son’s Individual Education Plan, you might be a bad parent."}, {"title": "NATIONAL FAMILY LITERACY DAY", "date": "11/1/2022", "content": "If the protest sign that you carried in front of the school contained three or more misspellings, you might be a bad parent."}, {"title": "ELECTION DAY", "date": "11/2/2022", "content": "If you have damaged a car running over “Vote for the School Levy” signs, you might be a bad parent."}, {"title": "GIVE SOMEONE A DOLLAR DAY", "date": "11/3/2022", "content": "If it is more important to get a new tattoo than to pay your rent, you might be a bad parent."}, {"title": "NATIONAL SKEPTICS DAY", "date": "11/4/2022", "content": "If you believe everything your child says, you might be a bad parent."}, {"title": "LOVE YOUR LAWYER DAY", "date": "11/5/2022", "content": "If your son has violated the athletic code by drinking alcohol, and you hire an attorney for the sole purpose of delaying consequences until wrestling season is over, you might be a bad parent."}, {"title": "BASKETBALL DAY", "date": "11/6/2022", "content": "If in protest of a referee’s call you have stolen the game ball at your son’s basketball game, you might be a bad parent."}, {"title": "LITTLE LEAGUE GIRLS DAY", "date": "11/7/2022", "content": "If you have altered your child’s birth certificate so she can play an additional year of little league softball, you might be a bad parent."}, {"title": "ABET AND AID PUNSTERS DAY", "date": "11/8/2022", "content": "If on a school information form you have listed “aiding and abetting,” as a shared family activity, you might be a bad parent."}, {"title": "NATIONAL CHAOS NEVER DIES DAY", "date": "11/9/2022", "content": "If your first words to your child when you enter the principal’s office are, “I don’t care what you did, son, I’ve got your back,” you might be a bad parent."}, {"title": "AREA CODE DAY", "date": "11/10/2022", "content": "If you have enrolled your child in seven different schools in one calendar year, you might be a bad parent."}, {"title": "SINGLES' DAY", "date": "11/11/2022", "content": "If you host a party for your daughter and her friends in hopes of finding a new dating partner, you might be a bad parent."}, {"title": "FANCY RAT AND MOUSE DAY", "date": "11/12/2022", "content": "If you have ever made the statement, “I’m not leaving this office until you tell me who snitched on my son,” you might be a bad parent."}, {"title": "ACTORS DAY", "date": "11/13/2022", "content": "If you are more steeped in school-girl drama than your daughter, you might be a bad parent."}, {"title": "INTERNATIONAL GIRL'S DAY", "date": "11/14/2022", "content": "If you have blamed your daughter’s truancy issues on PMS, you might be a bad parent."}, {"title": "DAY OF THE IMPRISONED WRITER", "date": "11/15/2022", "content": "If the school determined that it was your son who wrote the bomb threat on the bathroom wall based on the fact that your child cannot spell the word, “Bomb,” you might be a bad parent."}, {"title": "NATIONAL EDUCATIONAL SUPPORT PROFESSIONALS DAY", "date": "11/16/2022", "content": "If you refuse to meet with your son's high school principal unless you are given gas money, you might be a bad parent."}, {"title": "INTERNATIONAL STUDENTS' DAY", "date": "11/17/2022", "content": "If your child has been identified as “the wrong crowd,” you might be a bad parent."}, {"title": "GREAT AMERICAN SMOKEOUT", "date": "11/18/2022", "content": "If you fart audibly and continuously during a school suspension hearing, you might be a bad parent."}, 
    {"title": "EQUAL OPPORTUNITY DAY", "date": "11/19/2022", "content": "If you describe an act of vandalism that your son has committed as a crime of opportunity, you might be a bad parent."}, {"title": "FUTURE TEACHERS OF AMERICA DAY", "date": "11/20/2022", "content": "If upon completion of your GED you demand that the superintendent allow you to be this year's commencement speaker, you might be a bad parent."}, {"title": "FALSE CONFESSIONS DAY", "date": "11/21/2022", "content": "If even the persons you encouraged the school to call refuse to verify your son’s version of the story, you might be a bad parent."}, {"title": "GO FOR A RIDE DAY", "date": "11/22/2022", "content": "If you drive to school and are not willing to pick up your son, who is in eighth grade but are willing to pick up your boyfriend who is in twelfth grade, you might be a bad parent."}, {"title": "WHAT DO YOU LOVE ABOUT AMERICA DAY", "date": "11/23/2022", "content": "If you believe that your seventh-grade education qualifies you to tell your son’s high school teachers how to do their job, you might be a bad parent."}, {"title": "CELEBRATE YOUR UNIQUE TALENT DAY", "date": "11/24/2022", "content": "If the school conference room has to be fumigated after you attend a school meeting, you might be a bad parent."}, {"title": "NATIONAL DAY OF LISTENING", "date": "11/25/2022", "content": "If you believe that it your right to march into the school anytime and immediately be granted a meeting with your child’s teacher, guidance counselor, and principal, you might be a bad parent."}, {"title": "GOOD GRIEF DAY", "date": "11/26/2022", "content": "If you have felt it necessary to call the school guidance counselor each year to request a different teacher for your child, you might be a bad parent."}, {"title": "PINS AND NEEDLES DAY", "date": "11/27/2022", "content": "If you and your wife are “the others” that your daughter is trying to protect by not answering questions, you might be a bad parent."}, {"title": "IT'S LETTER WRITING DAY", "date": "11/28/2022", "content": "If the school has a folder that contains seven or more letters addressed to you with “return to sender” stamped on the envelope, you might be a bad parent."}, {"title": "CUSTOMER IS WRONG DAY", "date": "11/29/2022", "content": "If you have made the statement, “I think that it would be better if the school adjusts the rules to fit my son’s behavior,” you might be a bad parent."}, {"title": "NATIONAL STAY AT HOME BECAUSE YOU'RE WELL DAY", "date": "11/30/2022", "content": "If you and your children have driven by the principal’s home for the sole purpose of showing the principal that you know where he lives, you might be a bad parent."}, {"title": "ROSA PARK DAY", "date": "12/1/2022", "content": "If you have been accused of stalking a bus driver, you might be a bad parent."}, {"title": "SPECIAL EDUCATION DAY", "date": "12/2/2022", "content": "If you claim that screaming obscenities at adults is part of your child’s Individual Education Plan, you might be a bad parent."}, {"title": "BARTENDER APPRECIATION DAY", "date": "12/3/2022", "content": "If you have left a school event early to go to a bar or left a bar late to go to a school event, you might be a bad parent."}, {"title": "INTERNATIONAL SPIRIT OF THE GAME DAY", "date": "12/4/2022", "content": "If you have played pocket pool while attending a meeting at the school, you might be a bad parent."}, {"title": "NATIONAL COMMUNICATE WITH YOUR KIDS DAY", "date": "12/5/2022", "content": "If you demand a meeting with the principal to discuss your son's school attendance and on the day of the meeting you discover that your son is not in school attendance, you might be a bad parent."}, {"title": "PUT ON YOUR OWN SHOES DAY", "date": "12/6/2022", "content": "If you and/or your son have kicked open a door on your way out of a meeting in the principal’s office, you might be a bad parent."}, {"title": "INTERNATIONAL CIVIL AVIATION DAY", "date": "12/7/2022", "content": "If in the most recent update of the Merriam Webster Dictionary there is a picture of you by the definition of helicopter parent, you might be a bad parent."}, {"title": "PRETEND TO BE A TIME TRAVELER DAY", "date": "12/8/2022", "content": "If you claim in a phone conversation that you are an hour away from school, but make it there in five minutes when you are informed that your son has been arrested, you might be a bad parent."}, {"title": "INTERNATIONAL ANTI-CORRUPTION DAY", "date": "12/9/2022", "content": "If you have arrived at an expulsion hearing with five hundred or more pages of notes outlining the thirteen-year conspiracy that the school has perpetrated against your child, you might be a bad parent."}, {"title": "OFFICIAL LOST AND FOUND DAY", "date": "12/10/2022", "content": "If your son is in possession of stolen items and you have invoked the finders keepers losers weepers defense strategy, you might be a bad parent."}, {"title": "NATIONAL APP DAY", "date": "12/11/2022", "content": "If you claim that the text messages discovered on your son’s cell phone is proof that the Dean of Students stole your son’s phone to set up a drug deal, you might be a bad parent."}, {"title": "FESTIVAL OF UNMENTIONABLE THOUGHTS", "date": "12/12/2022", "content": "If you are dating your eighth-grade son’s best friend, you might be a bad parent."}, {"title": "NATIONAL DAY OF THE HORSE", "date": "12/13/2022", "content": "If you move to another state, leave your sixteen-year-old daughter behind, and her only transportation to school is a horse, you might be a bad parent."}, {"title": "MONKEY SEE DAY", "date": "12/14/2022", "content": "If your son is sent to the office because he has inappropriate material on his cell phone and upon arrival at school you realize that he has your cell phone, you might be a bad parent."}, {"title": "BILL OF RIGHTS DAY", "date": "12/15/2022", "content": "If both you and your child have invoked your Fifth Amendment right to remain silent at a suspension hearing, you might be a bad parent."}, {"title": "DAY OF RECONCILIATION", "date": "12/16/2022", "content": "If your agreement with your son's new behavior plan makes the school question the validity of the behavior plan, you might be a bad parent."}, {"title": "UNDERDOG DAY", "date": "12/17/2022", "content": "If your conspiracy theory of your son's failure involves seven or more teachers from four or more school districts from three or more states, you might be a bad parent."}, {"title": "NATIONAL TWIN DAY", "date": "12/18/2022", "content": "If you believe that “Slayer” and “Slasher” are appropriate names for your twin boys, you might be a bad parent."}, {"title": "NATIONAL HARD CANDY DAY", "date": "12/19/2022", "content": "If your claim that your son’s fundraising candy bars were stolen but your son comes to school for twenty-four consecutive days with a fundraising candy bar in his bag lunch, you might be a bad parent."}, {"title": "DOT YOUR “I”S DAY", "date": "12/20/2022", "content": "If you do not question the authenticity of a grade card that is hand-written on notebook paper, with all the “I’s” dotted with hearts, and the principal’s name misspelled, you might be a bad parent."}, {"title": "DON'T MAKE YOUR BED DAY", "date": "12/21/2022", "content": "If you have formally requested that school start an hour later because your child doesn’t like to get up early, you might be a bad parent."}, {"title": "ABILITIES DAY", "date": "12/22/2022", "content": "If neither you nor your son can make the moral distinction between being sorry that you got caught and being sorry that you did it, you might be a bad parent."}, {"title": "NATIONAL REGIFTING DAY", "date": "12/23/2022", "content": "If your insistence that your son should be placed in the gifted program is based solely on your claim that he has patented inventions used by NASA that you cannot share with the school for national security reasons, you might be a bad parent."}, {"title": "LAST-MINUTE SHOPPER'S DAY", "date": "12/24/2022", "content": "If you have had your son drive the getaway car when you knocked over a series of Convenient Stores, you might be a bad parent."}, {"title": "CHRISTMAS DAY", "date": "12/25/2022", "content": "If you get Christmas cards from more than one bail bondsman, you might be a bad parent."}, {"title": "BOXING DAY", "date": "12/26/2022", "content": "If during a suspension hearing you feel that it is important that the principal understand the difference between “punching” and “bitch-slapping,” you might be a bad parent."}, {"title": "NATIONAL WHINERS DAY", "date": "12/27/2022", "content": "If your thirty-one-year old child has been convicted of robbing a bank, but you still blame his grade school teachers, you might be a bad parent."}, {"title": "CALL A FRIEND DAY", "date": "12/28/2022", "content": "If you consider your son's best friends testimony as irrefutable proof of your son's innocence, you might be a bad parent."}, {"title": "STILL NEED TO DO DAY", "date": "12/29/2022", "content": "If your son receives a note from school saying that he is capable of doing better and you call the school to find out who, “Better,” is, you might be a bad parent."}, {"title": "FALLING NEEDLES FAMILY FEST DAY", "date": "12/30/2022", "content": "If your family puts the “fun” in “dysfunctional,” you might be a bad parent."}, {"title": "MAKE UP YOUR MIND DAY", "date": "12/31/2022", "content": "If you are given the option of an out of school or in school suspension, and you let your child make the decision, you might be a bad parent."}
   ]}